<?php
class String
{
	public static function translit($str) 
	{
		$tr = array(
			"À"=>"a","Á"=>"b","Â"=>"v","Ã"=>"g",
			"Ä"=>"d","Å"=>"e","Æ"=>"j","Ç"=>"z","È"=>"i",
	        "É"=>"y","Ê"=>"k","Ë"=>"l","Ì"=>"m","Í"=>"n",
	        "Î"=>"o","Ï"=>"p","Ð"=>"r","Ñ"=>"s","Ò"=>"t",
	        "Ó"=>"u","Ô"=>"f","Õ"=>"h","Ö"=>"ts","×"=>"ch",
	        "Ø"=>"sh","Ù"=>"sch","Ú"=>"","Û"=>"yi","Ü"=>"",
	        "Ý"=>"e","Þ"=>"yu","ß"=>"ya","à"=>"a","á"=>"b",
	        "â"=>"v","ã"=>"g","ä"=>"d","å"=>"e","æ"=>"j",
	        "ç"=>"z","è"=>"i","é"=>"y","ê"=>"k","ë"=>"l",
	        "ì"=>"m","í"=>"n","î"=>"o","ï"=>"p","ð"=>"r",
	        "ñ"=>"s","ò"=>"t","ó"=>"u","ô"=>"f","õ"=>"h",
	        "ö"=>"ts","÷"=>"ch","ø"=>"sh","ù"=>"sch","ú"=>"y",
	        "û"=>"yi","ü"=>"","ý"=>"e","þ"=>"yu","ÿ"=>"ya", 
	        " "=> "_", "."=> "", "/"=> "_"
	    );
	    
	    $complete = strtr(trim($str), $tr);
	    
		if (preg_match('/[^A-Za-z0-9_\-]/', $complete))
		    $complete = preg_replace('/[^A-Za-z0-9_\-]/', '', $complete);
	    
	    return $complete;
	}
}
?>